[net]
batch=32
subdivisions=1
height=90
width=90
channels=3 
momentum=0.9
learning_rate=0.01
policy=poly
power=4
num_iterations=5
num_pretrain_iterations=1
num_rbm_layers=3
num_threads=16

[rbm]
output=1500
k_step=1
activation=logistic

[rbm]
output=750
k_step=1
activation=logistic

[rbm]
output=20
k_step=1
activation=logistic

[connected]
output=36
activation=linear

[softmax]
groups=1

[cost]
type=l2
