[net]
batch=32
subdivisions=1
height=128
width=128
channels=3 
momentum=0.9
learning_rate=0.01
policy=poly
power=4
num_iterations=5
num_pretrain_iterations=1
num_rbm_layers=4
num_threads=16

[rbm]
output=2000
k_step=1
activation=logistic

[rbm]
output=1000
k_step=1
activation=logistic

[rbm]
output=500
k_step=1
activation=logistic

[rbm]
output=30
k_step=1
activation=logistic

[connected]
output=62
activation=linear

[softmax]
groups=1

[cost]
type=l2
