[net]
batch=32
subdivisions=1
height=64
width=64
channels=3 
momentum=0.9
learning_rate=0.01
num_iterations=5
num_pretrain_iterations=1
num_rbm_layers=2
num_threads=4

[rbm]
output=400
k_step=1
activation=logistic

[rbm]
output=10
k_step=1
activation=logistic

[connected]
output=10
activation=linear

[softmax]
groups=1

[cost]
type=l2
